Catalogs/Renault_ПрикрепленныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ПрикрепленныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВоВнешнемХранилище</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_ПрикрепленныеФайлы/Ext/ManagerModule.bsl
Функция ВернутьМассивФайловОбъекта(ВладелецФайла) Экспорт
	Результат = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ПрикрепленныеФайлы.ПутьКФайлу,
	               |	Renault_ПрикрепленныеФайлы.Файл,
	               |	Renault_ПрикрепленныеФайлы.ФайлВоВнешнемХранилище,
	               |	Renault_ПрикрепленныеФайлы.Ссылка
	               |ИЗ
	               |	Справочник.Renault_ПрикрепленныеФайлы КАК Renault_ПрикрепленныеФайлы
	               |ГДЕ
	               |	Renault_ПрикрепленныеФайлы.ВладелецФайла = &ВладелецФайла
	               |	И НЕ Renault_ПрикрепленныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецФайла",ВладелецФайла);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		СтруктураОписанияФайла = Новый Структура("ПутьКФайлу,Файл,ФайлВоВнешнемХранилище,Ссылка");
		ЗаполнитьЗначенияСвойств(СтруктураОписанияФайла,Выборка);
		Результат.Добавить(СтруктураОписанияФайла);
	КонецЦикла;	
	Возврат Результат;
КонецФункции

Функция РежимХраненияФайла() Экспорт
	// ИБ 			- в информационной базе
	// ВнешнийФайл 	- в общей сетевой папке
	// Выбирается 	- для каждого файла задается отдельно
	Возврат "ИБ";
КонецФункции
